wjb321/MSP432-/msp432/5_freertos_ledonOff/blinky.c
#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include "usart.h"
#include "delay.h"
//#include <gpio.h>
#include "ti/devices/msp432e4/driverlib/driverlib.h"
#include "uartstdio.h"
#include "pinout.h"
#include "timer.h"
#include "timers_config.h"
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "gpio.h"


/* Priorities at which the tasks are created. */
#define LED1_TASK_PRIORITY		( tskIDLE_PRIORITY + 2 )
#define	LED2_TASK_PRIORITY		( tskIDLE_PRIORITY + 1 )

/* The rate at which data is sent to the queue.  The 200ms value is converted
to ticks using the portTICK_PERIOD_MS constant. */
#define mainQUEUE_SEND_FREQUENCY_MS			( pdMS_TO_TICKS( 1000UL ) )

/* The number of items the queue can hold.  This is 1 as the receive task
will remove items as they are added, meaning the send task should always find
the queue empty. */
#define mainQUEUE_LENGTH					( 1 )

/* Values passed to the two tasks just to check the task parameter
functionality. */
#define LED2_PARAMETER			( 0x1111UL )
#define LED1_PARAMETER			( 0x22UL )

static void LED1Task( void *pvParameters );
static void LED2Task( void *pvParameters );

#define LEDOnOFFOrigin  0
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
  while(1);
}
#endif

extern uint32_t g_ui32SysClock;
static void prvSetupHardware( void );
int main1(void)
{
  g_ui32SysClock = MAP_SysCtlClockFreqSet((SYSCTL_XTAL_25MHZ |SYSCTL_OSC_MAIN | SYSCTL_USE_PLL |SYSCTL_CFG_VCO_480), 120000000);
	 PinoutSet(false, false);
  TIMER0A_config();	
	TIMER1A_config();
  ConfigureUART(115200);
  void delay_ms(uint16_t nms);
#if LEDOnOFFOrigin
  while(1)
    {

      LEDWrite(CLP_D1, 1);
      LEDWrite(CLP_D3, 1); // does not work
      SysCtlDelay(g_ui32SysClock / 10 / 3);
      LEDWrite(CLP_D1, 0);
      LEDWrite(CLP_D3, 0);// does not work
      SysCtlDelay(g_ui32SysClock / 10 / 3);
    }
#else

  while(1)
    {}
#endif
}


static QueueHandle_t xQueue = NULL;
int main( void )
{ 
	 g_ui32SysClock = MAP_SysCtlClockFreqSet((SYSCTL_XTAL_25MHZ |SYSCTL_OSC_MAIN | SYSCTL_USE_PLL |SYSCTL_CFG_VCO_480), 120000000);
	 PinoutSet(false, false);
  TIMER0A_config();	
	TIMER1A_config();
  ConfigureUART(115200);
  void delay_ms(uint16_t nms);
	/* Create the queue. */
	xQueue = xQueueCreate( mainQUEUE_LENGTH, sizeof( uint32_t ) );
	if( xQueue != NULL )
	{

		xTaskCreate( LED1Task,					/* The function that implements the task. */
					"led1", 									/* The text name assigned to the task - for debug only as it is not used by the kernel. */
					configMINIMAL_STACK_SIZE, 				/* The size of the stack to allocate to the task. */
					( void * ) LED1_PARAMETER, /* The parameter passed to the task - just to check the functionality. */
					LED1_TASK_PRIORITY, 		/* The priority assigned to the task. */
					NULL );									/* The task handle is not required, so NULL is passed. */

		xTaskCreate( LED2Task, 
					       "led1", 
					       configMINIMAL_STACK_SIZE, 
					        ( void * ) LED2_PARAMETER,
										LED2_TASK_PRIORITY, 
									 NULL );

		/* Start the tasks and timer running. */
		vTaskStartScheduler();
	}

	/* If all is well, the scheduler will now be running, and the following
	line will never be reached.  If the following line does execute, then
	there was insufficient FreeRTOS heap memory available for the idle and/or
	timer tasks	to be created.  See the memory management section on the
	FreeRTOS web site for more details. */
	for( ;; );
}


static void LED1Task( void *pvParameters )
{
unsigned long ulReceivedValue;
static const TickType_t xShortBlock = pdMS_TO_TICKS( 50 );

	/* Check the task parameter is as expected. */
	configASSERT( ( ( unsigned long ) pvParameters ) == LED1_PARAMETER );

	for( ;; )
	{ 
		
		/* Wait until something arrives in the queue - this task will block
		indefinitely provided INCLUDE_vTaskSuspend is set to 1 in
		FreeRTOSConfig.h. */
		//xQueueReceive( xQueue, &ulReceivedValue, portMAX_DELAY );

		/*  To get here something must have been received from the queue, but
		is it the expected value?  If it is, toggle the LED. */
		//if( ulReceivedValue == 100UL )
		//{
			/* Blip the LED for a short while so as not to use too much
			power. */
			UARTprintf("task1\n");
			MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1,~(MAP_GPIOPinRead(GPIO_PORTN_BASE, GPIO_PIN_1)));
			vTaskDelay( xShortBlock );
			 MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1,~(MAP_GPIOPinRead(GPIO_PORTN_BASE, GPIO_PIN_1)));
			ulReceivedValue = 0U;
		//}
	}
}


static void LED2Task( void *pvParameters )
{
unsigned long ulReceivedValue;
static const TickType_t xShortBlock = pdMS_TO_TICKS( 50 );

	/* Check the task parameter is as expected. */
	configASSERT( ( ( unsigned long ) pvParameters ) == LED2_PARAMETER );

	for( ;; )
	{
		/* Wait until something arrives in the queue - this task will block
		indefinitely provided INCLUDE_vTaskSuspend is set to 1 in
		FreeRTOSConfig.h. */
		//xQueueReceive( xQueue, &ulReceivedValue, portMAX_DELAY );

		/*  To get here something must have been received from the queue, but
		is it the expected value?  If it is, toggle the LED. */
		//if( ulReceivedValue == 100UL )
		//{
			/* Blip the LED for a short while so as not to use too much
			power. */
			UARTprintf("task2\n");
			MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0,~(MAP_GPIOPinRead(GPIO_PORTN_BASE, GPIO_PIN_0)));
			vTaskDelay( xShortBlock );
			MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0,~(MAP_GPIOPinRead(GPIO_PORTN_BASE, GPIO_PIN_0)));
			ulReceivedValue = 0U;
		//}
	}
}

//static void prvSetupHardware( void )
//{
//extern void FPU_enableModule( void );

//	/* The clocks are not configured here, but inside main_full() and
//	main_blinky() as the full demo uses a fast clock and the blinky demo uses
//	a slow clock. */

//	/* Stop the watchdog timer. */
//	MAP_WDT_A_holdTimer();

//	/* Ensure the FPU is enabled. */
//	FPU_enableModule();

//	/* Selecting P1.2 and P1.3 in UART mode and P1.0 as output (LED) */
//	MAP_GPIO_setAsPeripheralModuleFunctionInputPin( GPIO_PORT_P1, GPIO_PIN2 | GPIO_PIN3, GPIO_PRIMARY_MODULE_FUNCTION );
//	MAP_GPIO_setOutputLowOnPin( GPIO_PORT_P1, GPIO_PIN0 );
//	MAP_GPIO_setAsOutputPin( GPIO_PORT_P1, GPIO_PIN0 );
//}


void vApplicationIdleHook( void )
{
	/* vApplicationIdleHook() will only be called if configUSE_IDLE_HOOK is set
	to 1 in FreeRTOSConfig.h.  It will be called on each iteration of the idle
	task.  It is essential that code added to this hook function never attempts
	to block in any way (for example, call xQueueReceive() with a block time
	specified, or call vTaskDelay()).  If the application makes use of the
	vTaskDelete() API function (as this demo application does) then it is also
	important that vApplicationIdleHook() is permitted to return to its calling
	function, because it is the responsibility of the idle task to clean up
	memory allocated by the kernel to any task that has since been deleted. */
}


#if( configCREATE_SIMPLE_TICKLESS_DEMO == 1 )

	void vApplicationTickHook( void )
	{
		/* This function will be called by each tick interrupt if
		configUSE_TICK_HOOK is set to 1 in FreeRTOSConfig.h.  User code can be
		added here, but the tick hook is called from an interrupt context, so
		code must not attempt to block, and only the interrupt safe FreeRTOS API
		functions can be used (those that end in FromISR()). */

		/* Only the full demo uses the tick hook so there is no code is
		executed here. */
	}

#endif

void vApplicationStackOverflowHook( TaskHandle_t pxTask, char *pcTaskName )
{
	( void ) pcTaskName;
	( void ) pxTask;

	/* Run time stack overflow checking is performed if
	configCHECK_FOR_STACK_OVERFLOW is defined to 1 or 2.  This hook
	function is called if a stack overflow is detected. */
	taskDISABLE_INTERRUPTS();
	for( ;; );
}

void vApplicationMallocFailedHook( void )
{
	/* vApplicationMallocFailedHook() will only be called if
	configUSE_MALLOC_FAILED_HOOK is set to 1 in FreeRTOSConfig.h.  It is a hook
	function that will get called if a call to pvPortMalloc() fails.
	pvPortMalloc() is called internally by the kernel whenever a task, queue,
	timer or semaphore is created.  It is also called by various parts of the
	demo application.  If heap_1.c or heap_2.c are used, then the size of the
	heap available to pvPortMalloc() is defined by configTOTAL_HEAP_SIZE in
	FreeRTOSConfig.h, and the xPortGetFreeHeapSize() API function can be used
	to query the size of free heap space that remains (although it does not
	provide information on how the remaining heap might be fragmented). */
	taskDISABLE_INTERRUPTS();
	for( ;; );
}


void vPreSleepProcessing( uint32_t ulExpectedIdleTime )
{
}